bookers1/assignment2/app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
    if @book.save
      flash[:notice] ="Book was successfully created."
  	  redirect_to book_path(@book)
  	else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "投稿"], ["body", "fu"], ["created_at", "2020-04-18 01:19:59.054935"], ["updated_at", "2020-04-18 01:19:59.054935"]]
SELECT "books".* FROM "books"

  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "4d0jp"], ["body", "du5pe9tfs12obupptobm"], ["updated_at", "2020-04-18 02:09:14.252383"], ["id", 1]]